Tekla.Structures.Filtering.Categories.SurfaceFilterExpressions.Name
The Name class represents the name filter expression.

Tekla.Structures.Filtering.Categories.SurfaceFilterExpressions.Name.#ctor
Initializes a new instance of the Name class.